###  Part # 1
  #### Terraform Format and Style 🖌`failure`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/2f5b3f4e-84da-4742-8192-2c1e3f6a0269/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.lambda_src has been deleted
  - resource "local_file" "lambda_src" {
      - filename             = "lambda_function.py" -> null
        id                   = "5736b090cd453cd268c095628fbb59febe455df0"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "lambda_function.py"
      + type                = "zip"
    }

  # aws_lambda_function.ec2_control will be updated in-place
  ~ resource "aws_lambda_function" "ec2_control" {
        id                             = "EC2_Control_Lambda"
      ~ last_modified                  = "2025-11-06T15:08:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "HgMj8Fo4eQsTbor8FxT0SILjMM9BqGJI/f6VCLe1Vxk=" -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.staticwebsiterraform must be replaced
-/+ resource "aws_s3_bucket" "staticwebsiterraform" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::ec2ondemandja2625-unique12345" -> (known after apply)
      ~ bucket                      = "ec2ondemandja2625-unique12345" -> "2ec2ondemandja2625-unique12345" # forces replacement
      ~ bucket_domain_name          = "ec2ondemandja2625-unique12345.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "ec2ondemandja2625-unique12345.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "ec2ondemandja2625-unique12345" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
            "Environment" = "Dev"
          ~ "Name"        = "ec2ondemandja2625-unique12345" -> "2ec2ondemandja2625-unique12345"
        }
      ~ tags_all                    = {
          ~ "Name"        = "ec2ondemandja2625-unique12345" -> "2ec2ondemandja2625-unique12345"
            # (1 unchanged element hidden)
        }
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "ec2ondemandja2625-unique12345.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "40d34bdddf9178a3a37921b3789251b8cf34fb8132eaa39358afe91153da6e7c" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_acl.acl must be replaced
-/+ resource "aws_s3_bucket_acl" "acl" {
      ~ bucket = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "ec2ondemandja2625-unique12345,public-read" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "40d34bdddf9178a3a37921b3789251b8cf34fb8132eaa39358afe91153da6e7c" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "gabousmen" -> null
              - id           = "40d34bdddf9178a3a37921b3789251b8cf34fb8132eaa39358afe91153da6e7c" -> null
            }
        }
    }

  # aws_s3_bucket_ownership_controls.ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "ownership" {
      ~ bucket = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "ec2ondemandja2625-unique12345" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_public_access_block.publicaccess must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "publicaccess" {
      ~ bucket                  = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "ec2ondemandja2625-unique12345" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_website_configuration.website must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "website" {
      ~ bucket           = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement
      ~ id               = "ec2ondemandja2625-unique12345" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "ec2ondemandja2625-unique12345.s3-website-us-east-1.amazonaws.com" -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.error will be created
  + resource "aws_s3_object" "error" {
      + acl                    = "public-read"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "error.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.index will be created
  + resource "aws_s3_object" "index" {
      + acl                    = "public-read"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.lambda_src will be created
  + resource "local_file" "lambda_src" {
      + content              = <<-EOT
            import json
            import boto3
            
            ec2 = boto3.client("ec2")
            
            TAG_KEY = "Environment"
            TAG_VALUE = "Dev"
            
            def list_instances():
                resp = ec2.describe_instances(
                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]
                )
                instances = []
                for r in resp["Reservations"]:
                    for i in r["Instances"]:
                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))
                        instances.append({
                            "id": i["InstanceId"],
                            "name": name,
                            "state": i["State"]["Name"]
                        })
                return instances
            
            def lambda_handler(event, context):
                # Parse API Gateway HTTP API v2 body if it exists
                body = event.get("body")
                if body:
                    try:
                        data = json.loads(body)
                    except json.JSONDecodeError:
                        return {
                            "statusCode": 400,
                            "body": json.dumps({"error": "Invalid JSON in request body"})
                        }
                else:
                    data = event
            
                action = data.get("action")
                instance_id = data.get("instance_id")
            
                if action == "list":
                    return {"statusCode": 200, "body": json.dumps(list_instances())}
            
                if not instance_id:
                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}
            
                if action == "start":
                    ec2.start_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}
            
                if action == "stop":
                    ec2.stop_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}
            
                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "lambda_function.py"
      + id                   = (known after apply)
    }

Plan: 8 to add, 1 to change, 5 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # local_file.lambda_src has been deleted%0A  - resource "local_file" "lambda_src" {%0A      - filename             = "lambda_function.py" -> null%0A        id                   = "5736b090cd453cd268c095628fbb59febe455df0"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.archive_file.lambda_zip will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "archive_file" "lambda_zip" {%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = "lambda_function.zip"%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_file         = "lambda_function.py"%0A      + type                = "zip"%0A    }%0A%0A  # aws_lambda_function.ec2_control will be updated in-place%0A  ~ resource "aws_lambda_function" "ec2_control" {%0A        id                             = "EC2_Control_Lambda"%0A      ~ last_modified                  = "2025-11-06T15:08:20.000+0000" -> (known after apply)%0A      ~ source_code_hash               = "HgMj8Fo4eQsTbor8FxT0SILjMM9BqGJI/f6VCLe1Vxk=" -> (known after apply)%0A        tags                           = {}%0A        # (20 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_s3_bucket.staticwebsiterraform must be replaced%0A-/+ resource "aws_s3_bucket" "staticwebsiterraform" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      ~ arn                         = "arn:aws:s3:::ec2ondemandja2625-unique12345" -> (known after apply)%0A      ~ bucket                      = "ec2ondemandja2625-unique12345" -> "2ec2ondemandja2625-unique12345" # forces replacement%0A      ~ bucket_domain_name          = "ec2ondemandja2625-unique12345.s3.amazonaws.com" -> (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      ~ bucket_regional_domain_name = "ec2ondemandja2625-unique12345.s3.us-east-1.amazonaws.com" -> (known after apply)%0A      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)%0A      ~ id                          = "ec2ondemandja2625-unique12345" -> (known after apply)%0A      ~ object_lock_enabled         = false -> (known after apply)%0A      + policy                      = (known after apply)%0A      ~ region                      = "us-east-1" -> (known after apply)%0A      ~ request_payer               = "BucketOwner" -> (known after apply)%0A      ~ tags                        = {%0A            "Environment" = "Dev"%0A          ~ "Name"        = "ec2ondemandja2625-unique12345" -> "2ec2ondemandja2625-unique12345"%0A        }%0A      ~ tags_all                    = {%0A          ~ "Name"        = "ec2ondemandja2625-unique12345" -> "2ec2ondemandja2625-unique12345"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint            = "ec2ondemandja2625-unique12345.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      - grant {%0A          - permissions = [%0A              - "READ",%0A            ] -> null%0A          - type        = "Group" -> null%0A          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null%0A        }%0A      - grant {%0A          - id          = "40d34bdddf9178a3a37921b3789251b8cf34fb8132eaa39358afe91153da6e7c" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A%0A      - website {%0A          - error_document = "error.html" -> null%0A          - index_document = "index.html" -> null%0A        }%0A    }%0A%0A  # aws_s3_bucket_acl.acl must be replaced%0A-/+ resource "aws_s3_bucket_acl" "acl" {%0A      ~ bucket = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "ec2ondemandja2625-unique12345,public-read" -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      - access_control_policy {%0A          - grant {%0A              - permission = "READ" -> null%0A%0A              - grantee {%0A                  - type = "Group" -> null%0A                  - uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null%0A                }%0A            }%0A          - grant {%0A              - permission = "FULL_CONTROL" -> null%0A%0A              - grantee {%0A                  - id   = "40d34bdddf9178a3a37921b3789251b8cf34fb8132eaa39358afe91153da6e7c" -> null%0A                  - type = "CanonicalUser" -> null%0A                }%0A            }%0A          - owner {%0A              - display_name = "gabousmen" -> null%0A              - id           = "40d34bdddf9178a3a37921b3789251b8cf34fb8132eaa39358afe91153da6e7c" -> null%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket_ownership_controls.ownership must be replaced%0A-/+ resource "aws_s3_bucket_ownership_controls" "ownership" {%0A      ~ bucket = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement%0A      ~ id     = "ec2ondemandja2625-unique12345" -> (known after apply)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # aws_s3_bucket_public_access_block.publicaccess must be replaced%0A-/+ resource "aws_s3_bucket_public_access_block" "publicaccess" {%0A      ~ bucket                  = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement%0A      ~ id                      = "ec2ondemandja2625-unique12345" -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_bucket_website_configuration.website must be replaced%0A-/+ resource "aws_s3_bucket_website_configuration" "website" {%0A      ~ bucket           = "ec2ondemandja2625-unique12345" # forces replacement -> (known after apply) # forces replacement%0A      ~ id               = "ec2ondemandja2625-unique12345" -> (known after apply)%0A      + routing_rules    = (known after apply)%0A      ~ website_domain   = "s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A      ~ website_endpoint = "ec2ondemandja2625-unique12345.s3-website-us-east-1.amazonaws.com" -> (known after apply)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_s3_object.error will be created%0A  + resource "aws_s3_object" "error" {%0A      + acl                    = "public-read"%0A      + bucket                 = (known after apply)%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "error.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "error.html"%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A    }%0A%0A  # aws_s3_object.index will be created%0A  + resource "aws_s3_object" "index" {%0A      + acl                    = "public-read"%0A      + bucket                 = (known after apply)%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "index.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "index.html"%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A    }%0A%0A  # local_file.lambda_src will be created%0A  + resource "local_file" "lambda_src" {%0A      + content              = <<-EOT%0A            import json%0A            import boto3%0A            %0A            ec2 = boto3.client("ec2")%0A            %0A            TAG_KEY = "Environment"%0A            TAG_VALUE = "Dev"%0A            %0A            def list_instances():%0A                resp = ec2.describe_instances(%0A                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]%0A                )%0A                instances = []%0A                for r in resp["Reservations"]:%0A                    for i in r["Instances"]:%0A                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))%0A                        instances.append({%0A                            "id": i["InstanceId"],%0A                            "name": name,%0A                            "state": i["State"]["Name"]%0A                        })%0A                return instances%0A            %0A            def lambda_handler(event, context):%0A                # Parse API Gateway HTTP API v2 body if it exists%0A                body = event.get("body")%0A                if body:%0A                    try:%0A                        data = json.loads(body)%0A                    except json.JSONDecodeError:%0A                        return {%0A                            "statusCode": 400,%0A                            "body": json.dumps({"error": "Invalid JSON in request body"})%0A                        }%0A                else:%0A                    data = event%0A            %0A                action = data.get("action")%0A                instance_id = data.get("instance_id")%0A            %0A                if action == "list":%0A                    return {"statusCode": 200, "body": json.dumps(list_instances())}%0A            %0A                if not instance_id:%0A                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}%0A            %0A                if action == "start":%0A                    ec2.start_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}%0A            %0A                if action == "stop":%0A                    ec2.stop_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}%0A            %0A                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "lambda_function.py"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 8 to add, 1 to change, 5 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @jangama3, Action: `pull_request`, Workflow: `Terraform`*